# 数据预处理
创建一个人工数据集，并存储在csv（逗号分隔值）文件

In [2]:
import os

os.makedirs(os.path.join('..', 'data'), exist_ok=True)
data_file = os.path.join('..', 'data', 'house_tiny.csv')
with open(data_file, 'w') as f:
    # 'w': 打开一个文件只用于写入。如果该文件已存在则将其覆盖。
    # 如果该文件不存在，创建新文件。
    f.write('NumRooms,Alley,Price\n') #列名
    f.write('NA,Pave,127500\n') #每行表示一个数据样本
    f.write('2,NA,106000\n')
    f.write('4,NA,178100\n')
    f.write('NA,NA,140000\n')

In [3]:
import pandas as pd

data = pd.read_csv(data_file)
print(data)

   NumRooms Alley   Price
0       NaN  Pave  127500
1       2.0   NaN  106000
2       4.0   NaN  178100
3       NaN   NaN  140000

In [4]:
data

   NumRooms Alley   Price
0       NaN  Pave  127500
1       2.0   NaN  106000
2       4.0   NaN  178100
3       NaN   NaN  140000

处理缺失数据，典型方法包括 插值 和 删除，这里我们考虑插值

In [5]:
inputs, outputs = data.iloc[:, 0:2], data.iloc[:, 2]

In [6]:
inputs

   NumRooms Alley
0       NaN  Pave
1       2.0   NaN
2       4.0   NaN
3       NaN   NaN

In [7]:
outputs

0    127500
1    106000
2    178100
3    140000
Name: Price, dtype: int64

In [8]:
inputs.mean()

NumRooms    3.0
dtype: float64

In [9]:
inputs = inputs.fillna(inputs.mean())

In [10]:
inputs

   NumRooms Alley
0       3.0  Pave
1       2.0   NaN
2       4.0   NaN
3       3.0   NaN

处理string: 对于 `inputs` 中的类别值或离散值，
我们将“NaN”视为一个类别

In [11]:
inputs = pd.get_dummies(inputs, dummy_na=True)
inputs

   NumRooms  Alley_Pave  Alley_nan
0       3.0           1          0
1       2.0           0          1
2       4.0           0          1
3       3.0           0          1

现在`inputs`和`outputs`中所有的条目都是数值类型，它们可以转换为张量格式。

In [12]:
import torch
X, y = torch.tensor(inputs.values), torch.tensor(outputs.values)
X, y

(tensor([[3., 1., 0.],
         [2., 0., 1.],
         [4., 0., 1.],
         [3., 0., 1.]], dtype=torch.float64),
 tensor([127500, 106000, 178100, 140000]))